[
  {
    "id":0,
    "t1": "Welcome, proACTive is a very simple, minimal command line application.\n\nThis application was born out of the need of the developer because he was a voracious procrastinator. Almost all devs are, he thought.\n\nAnd almost all nurturing devs are getting distracted very easily (Duh, we work on digital media!) \nAnd yes, let this be a brief intro to get you started(Really, it's short!)",
    "t2": "This app is intended to be very minimal. \n\nYou add a task, and you do it.That's pretty much it!\n\nYou get very little slack to procrastinate if you ever needed one.\n(You either do a task, or delete it, there's no in-betweens(See what I did there? Binary? No? Okay)) ",
    "t3": "Let's get started. \n\nact <command> <options> is the general format. You can always come back to this tutorial, or use --help on any command.",
    "t4": "Adding a task:\n\nact add -n 'Clean Room' -l 4.5 -d 4 dec\nact add --name 'Clean Room' --length 4.5 --due 4 dec where, \n\nname/n is the name of the task, length/l is the time needed for the task to be completed(eg:4.5hours) and due/d is the deadline.\n\nBeware of the quotes. Name is a string, length is a floating number, and due is a number followed by string (date month) separated by space",
    "t5": "Listing available tasks\n\n(Note: Default list command gives you task of length 3 hrs or less)\nDon't worry about which task to do first, it's sorted. All you need to give is the amount of time you have right now\n\nThe color code goes like this:\n\t1.Green: Do it you'll thank me later.\n\t2.Yellow: Psst, you need to get this right away!\n\t3.Red: Dude! *facepalm(yourself)* This is over-due. Do it or delete it.\n\nUse act list or act list -l 4 or act list --length 4\n\nTo stop procrastinating, we strictly suggest you use -l to specify how much time you have. Trust me, You're more likely to do a task if you are not overwhelmed.",
    "t6": "Doing a task.\n\nOnce 'list'ed, you can do a task by simple 'act do'.\n\nIf you have used listed tasks earlier, a task is already preselected to help you. You can also select a task to do by act do -i 3 or act do --id 3, where id is the id of the task.\n\nOnce you 'do' a task, it's marked as done. Simple. I believe you to get it completed. (If you doubt yourself, don't 'do a task)",
    "t7": "RECAP:\n\nYou can,\n\t1.Add\n\t2.List\n\t3.Do\n\nIsn't that minimal enough for you?\n\nThis is open source, ping me to add a feature, or if you think you can do better, fork it! :)"
  },
  {
    "id": 1
  }
]